1. ¿Qué es Pandas?
Pandas es una librería de Python utilizada para el análisis de datos. Proporciona estructuras de datos y herramientas que facilitan la manipulación, limpieza y análisis de datos, especialmente cuando se trabaja con datos tabulares, como los encontrados en archivos CSV, Excel o bases de datos SQL.

In [2]:
import pandas as pd

# Crear una Serie simple
serie = pd.Series([10, 20, 30, 40, 50])
print(serie)

0    10
1    20
2    30
3    40
4    50
dtype: int64

2. Estructuras de Datos en Pandas

In [3]:
data = {
    'Nombre': ['Ana', 'Luis', 'Pedro', 'María'],
    'Edad': [23, 35, 45, 36],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla']
}

df = pd.DataFrame(data)
print(df)

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Luis    35  Barcelona
2  Pedro    45   Valencia
3  María    36    Sevilla

Lectura de Datos: Pandas facilita la lectura de datos desde diferentes formatos (CSV, Excel, SQL, JSON).

In [10]:
# Leer un archivo CSV
df = pd.read_csv('ejemplo_data.csv')

In [12]:
print(df.head())  # Muestra las primeras 5 filas
print(df.info())  # Muestra un resumen del DataFrame
print(df.describe())  # Estadísticas básicas

       ID        Nombre         2016          2017 Crecimiento Unidades  \
0   10002     Verde Mar  $125,000.00    $162500.00      30.00%      500
1  552278  Manantial sa  $920,000.00  $101,2000.00      10.00%      700
2   23477          ACME   $50,000.00      62500.00      25.00%      125
3   24900     Andes sur  $350,000.00     490000.00       4.00%       75
4  651029     San Pablo   $15,000.00     $12750.00     -15.00%       No

        fecha Activo
0   1-10-2015      1
1   6-23-2014      0
2   3-12-2016      1
3  10-28-2015      1
4   2-15-2014      0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           6 non-null      int64
 1   Nombre       6 non-null      object
 2   2016         6 non-null      object
 3   2017         6 non-null      object
 4   Crecimiento  6 non-null      object
 5   Unidades     6 non-null      object
 6   fecha        6 non-null      object
 7   Activo       6 non-null      object
dtypes: int64(1), object(7)
memory usage: 516.0+ bytes
None
                  ID
count       6.000000
mean   318785.833333
std    329913.104103
min     10002.000000
25%     23832.750000
50%    288589.000000
75%    626341.250000
max    651029.000000

Selección de columnas:

In [14]:
nombres = df['Nombre']

In [15]:
nombres

0       Verde Mar
1    Manantial sa
2            ACME
3       Andes sur
4       San Pablo
5       San Pablo
Name: Nombre, dtype: object

Selección de filas:

In [16]:
primera_fila = df.iloc[0]  # Por índice
segunda_fila = df.loc[1]   # Por etiqueta

A.	Lectura y análisis exploratorio de datos<br>
a.	Abrir Google Colab o Jupyter Notebook.<br>
b.	Importe (e instale en caso de ser necesario) librería pandas.<br>
c.	Cargar la base de datos de nombre ejemplo_data.csv. Explorar las diferentes opciones de read que tiene disponible la librería Pandas, identificando los argumentos disponibles en cada una de ellas.<br>
d.	Identifique los tipos de variables que hay disponibles en la base de datos (df.types o df.info()).<br>
e.	Utilizando la función astype, transforme el atributo ID a entero y el atributo activo a binario. Vuelva a consultar el estado de las variables.<br>
f.	Convierta el atributo unidades a entero y 2016 a flotante.<br>

In [17]:
df1 = pd.read_csv('ejemplo_data.csv')
df2 = pd.read_csv( 'ejemplo_data.csv',sep=',')
df3 = pd.read_csv('ejemplo_data.csv' , sep=',',header=0, names=['ID','Nombres','2016','2017','Crecimiento','Unidades','fecha','Activos'])

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           6 non-null      int64
 1   Nombre       6 non-null      object
 2   2016         6 non-null      object
 3   2017         6 non-null      object
 4   Crecimiento  6 non-null      object
 5   Unidades     6 non-null      object
 6   fecha        6 non-null      object
 7   Activo       6 non-null      object
dtypes: int64(1), object(7)
memory usage: 516.0+ bytes

In [19]:
df2.dtypes

ID              int64
Nombre         object
2016           object
2017           object
Crecimiento    object
Unidades       object
fecha          object
Activo         object
dtype: object

In [20]:
df1['ID']=df1['ID'].astype(int)
df1['Activo']=df1['Activo'].astype(bool)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           6 non-null      int32
 1   Nombre       6 non-null      object
 2   2016         6 non-null      object
 3   2017         6 non-null      object
 4   Crecimiento  6 non-null      object
 5   Unidades     6 non-null      object
 6   fecha        6 non-null      object
 7   Activo       6 non-null      bool
dtypes: bool(1), int32(1), object(6)
memory usage: 450.0+ bytes

In [21]:
def convertirAEntero(valor :object):
    nuevo=0
    if (isinstance(valor,int)):
        nuevo = valor
    elif(isinstance(valor,float)):
        nuevo =  int(valor)
    else :
        try:
         #
         nuevo = int(valor)   
        except Exception as error:
            print(error)    
    return nuevo

In [22]:
df1["Unidades"] = df1["Unidades"].apply(convertirAEntero)
df1.head(6)

invalid literal for int() with base 10: 'No'
invalid literal for int() with base 10: 'No'

,ID,Nombre,2016,2017,Crecimiento,Unidades,fecha,Activo
0,10002,Verde Mar,"$125,000.00",$162500.00,30.00%,500,1-10-2015,True
1,552278,Manantial sa,"$920,000.00","$101,2000.00",10.00%,700,6-23-2014,True
2,23477,ACME,"$50,000.00",62500.00,25.00%,125,3-12-2016,True
3,24900,Andes sur,"$350,000.00",490000.00,4.00%,75,10-28-2015,True
4,651029,San Pablo,"$15,000.00",$12750.00,-15.00%,0,2-15-2014,True
5,651029,San Pablo,"-$15,000.00",$ 12750.00,-15.00%,0,2-15-2014,True

In [23]:
def convertirAFloat(valor :object):
    nuevo=0.0
    if(isinstance(valor,float)):
        nuevo =  valor
    else :
        try:
             nuevo_data = valor.replace(',','').replace('$', '')
             nuevo = float(nuevo_data)   
        except Exception as error:
            print(error)    
    return nuevo

In [24]:
df1["2016"] = df1["2016"].apply(convertirAFloat)
df1.head(6)

,ID,Nombre,2016,2017,Crecimiento,Unidades,fecha,Activo
0,10002,Verde Mar,125000.0,$162500.00,30.00%,500,1-10-2015,True
1,552278,Manantial sa,920000.0,"$101,2000.00",10.00%,700,6-23-2014,True
2,23477,ACME,50000.0,62500.00,25.00%,125,3-12-2016,True
3,24900,Andes sur,350000.0,490000.00,4.00%,75,10-28-2015,True
4,651029,San Pablo,15000.0,$12750.00,-15.00%,0,2-15-2014,True
5,651029,San Pablo,-15000.0,$ 12750.00,-15.00%,0,2-15-2014,True

B.	Estadísticas descriptivas<br>
<ol>
<li>a.	Cree un set de datos  con 20 datos que contenga al menos dos atributos continuos y una variable categórica (por ejemplo: nombre, nota, edad).</li>
<li>b.	Transforme dicho set de datos  a un data frame de pandas.</li>
<li>c.	Obtenga estadísticas descriptivas de tendencia central.</li>
<li>d.	Obtenga estadísticas descriptivas de dispersión.</li>
<ol>

In [25]:
nombres = ["Lionel Messi", "Cristiano Ronaldo", "Neymar Jr.", "Kylian Mbappé", "Robert Lewandowski",
           "Kevin De Bruyne", "Mohamed Salah", "Erling Haaland", "Harry Kane", "Eden Hazard",
           "Sergio Ramos", "Virgil van Dijk", "Toni Kroos", "Paul Pogba", "N'Golo Kanté",
           "Manuel Neuer", "Jan Oblak", "Marc-André ter Stegen", "Thibaut Courtois", "David de Gea"]

posiciones = ["Delantero", "Delantero", "Delantero", "Delantero", "Delantero", "Mediocampista", "Delantero",
              "Delantero", "Delantero", "Mediocampista", "Defensa", "Defensa", "Mediocampista", "Mediocampista",
              "Mediocampista", "Portero", "Portero", "Portero", "Portero", "Portero"]

alturas = [1.70, 1.87, 1.75, 1.78, 1.85, 1.81, 1.75, 1.94, 1.88, 1.75, 1.84, 1.93, 1.83, 1.86, 1.72,
           1.93, 1.88, 1.91, 1.99, 1.91]

pesos = [72, 84, 68, 73, 80, 73, 71, 88, 87, 73, 84, 92, 83, 79, 70,
          90, 87, 89, 96, 97]

fechas_nacimiento = ["1987-06-24", "1985-02-05", "1992-02-05", "1998-12-20", "1988-08-21",
                     "1991-06-28", "1992-06-15", "2000-07-21", "1993-07-28", "1991-01-07",
                     "1986-03-05", "1991-07-13", "1990-11-04", "1993-03-15", "1991-03-29",
                     "1986-03-27", "1993-10-07", "1992-04-30", "1992-05-11", "1989-11-07"]

nacionalidades = ["Argentina", "Portugal", "Brasil", "Francia", "Polonia", "Bélgica", "Egipto", "Noruega",
                  "Inglaterra", "Bélgica", "España", "Países Bajos", "Alemania", "Francia", "Francia",
                  "Alemania", "Eslovenia", "Alemania", "Bélgica", "España"]

equipos_actuales = ["PSG", "Al Nassr", "PSG", "PSG", "FC Barcelona", "Manchester City", "Liverpool",
                     "Manchester City", "Tottenham Hotspur", "Real Madrid", "PSG", "Liverpool", "Real Madrid",
                     "Juventus", "Chelsea", "Bayern Munich", "Atlético de Madrid", "FC Barcelona", "Real Madrid",
                     "Manchester United"]

valores_mercado = [80, 50, 75, 120, 55, 100, 85, 150, 100, 75, 45, 75, 65, 60, 50,
                     40, 45, 40, 60, 50]
data = { 'nombre' : pd.Series(nombres),
         'altura' : pd.Series(alturas),
         'peso'   : pd.Series(pesos),  
         'posicion' : pd.Series(posiciones),
         'fecha_nacimiento' : pd.Series(fechas_nacimiento),
         'nacionalidad' : pd.Series(nacionalidades),
         'equipos_actual' : pd.Series(equipos_actuales),
         'valores_mercado'  : pd.Series(valores_mercado) }
sportdata = pd.DataFrame(data)

sportdata.head()

,nombre,altura,peso,posicion,fecha_nacimiento,nacionalidad,equipos_actual,valores_mercado
0,Lionel Messi,1.70,72,Delantero,1987-06-24,Argentina,PSG,80
1,Cristiano Ronaldo,1.87,84,Delantero,1985-02-05,Portugal,Al Nassr,50
2,Neymar Jr.,1.75,68,Delantero,1992-02-05,Brasil,PSG,75
3,Kylian Mbappé,1.78,73,Delantero,1998-12-20,Francia,PSG,120
4,Robert Lewandowski,1.85,80,Delantero,1988-08-21,Polonia,FC Barcelona,55

In [26]:
import  numpy as np
print('Altura Mean:', np.round(sportdata['altura'].mean(),2))
print('Altura Media', np.round(sportdata['altura'].median(),2))
print('Peso Moda ', np.round(sportdata['altura'].mode(),2))

Altura Mean: 1.84
Altura Media 1.86
Peso Moda  0    1.75
Name: altura, dtype: float64

In [27]:
print('Peso Media:', np.round(sportdata['peso'].mean(),2))
print('Peso Media ', np.round( sportdata['peso'].median(),2))
print('Peso Moda ', np.round(sportdata['peso'].mode(),2))

Peso Media: 81.8
Peso Media  83.5
Peso Moda  0    73
Name: peso, dtype: int64

In [28]:
print('Altura Varianza', np.round( sportdata['altura'].var(),2))
print('Altura Desviacion standar', np.round(sportdata['altura'].std(),2))
print('Peso Varianza', np.round( sportdata['peso'].var(),2))
print('Peso Desviacion standar', np.round( sportdata['peso'].std(),2))

Altura Varianza 0.01
Altura Desviacion standar 0.08
Peso Varianza 81.33
Peso Desviacion standar 9.02

In [29]:
print('Valor del mercado Media:', np.round(sportdata['valores_mercado'].mean(),2))
print('Valor del mercado Media ', np.round( sportdata['valores_mercado'].median(),2))
print('Valor del mercado Moda ', np.round(sportdata['valores_mercado'].mode(),2))

Valor del mercado Media: 71.0
Valor del mercado Media  62.5
Valor del mercado Moda  0    50
1    75
Name: valores_mercado, dtype: int64

In [30]:
sportdata[['altura','valores_mercado']].cov()

                   altura  valores_mercado
altura           0.006615        -0.272632
valores_mercado -0.272632       830.526316